<?php
// payment 코드
$arrPaymethodCode = array(
	"VCard" => "card",
	"Card"	=> "card",
	"DirectBank"	=> "tran",
	"HPP"	=> "hp",
	"VBank"	=> "bank"
);

// 카드사 코드
$arrCardCode = array(
	"01" => "외환",
	"03" => "롯데",
	"04" => "현대",
	"06" => "국민",
	"11" => "BC",
	"12" => "삼성",
	"13" => "LG",
	"14" => "신한",
	"15" => "한미",
	"21" => "해외비자",
	"22" => "해외마스터",
	"23" => "JCB",
	"24" => "해외아멕스",
	"25" => "해외다이너스"
);

$arrCardBankCode = array(
	"02" => "한국산업은행",
	"03" => "기업은행",
	"04" => "국민은행(주택은행)",
	"05" => "외환은행",
	"07" => "수협중앙회",
	"11" => "농협중앙회",
	"12" => "단위농협",
	"16" => "축협중앙회",
	"20" => "우리은행",
	"21" => "신한은행(조흥은행)",
	"23" => "제일은행",
	"25" => "하나은행(서울은행)",
	"26" => "신한은행",
	"27" => "한국씨티은행(한미은행)",
	"31" => "대구은행",
	"32" => "부산은행",
	"34" => "광주은행",
	"35" => "제주은행",
	"37" => "전북은행",
	"38" => "강원은행",
	"39" => "경남은행",
	"41" => "비씨카드",
	"53" => "씨티은행",
	"54" => "홍콩상하이은행",
	"71" => "우체국",
	"81" => "하나은행",
	"83" => "평화은행",
	"87" => "신세계",
	"88" => "신한은행(조흥 통합)"
);

$arrBankCode = array(
	"03" => "기업은행",
	"04" => "국민은행",
	"05" => "외환은행",
	"07" => "수협중앙회",
	"11" => "농협중앙회",
	"20" => "우리은행",
	"23" => "SC제일은행",
	"31" => "대구은행",
	"32" => "부산은행",
	"34" => "광주은행",
	"37" => "전북은행",
	"39" => "경남은행",
	"53" => "한국씨티은행",
	"71" => "우체국",
	"81" => "하나은행",
	"88" => "통합신한은행(신한,조흥은행)"
);
?>